/**
 * Created by fan_lv on 2017-9-26 0026.
 */

<!--图表1黑臭水体 - 断面水质变化-->
var data = {};
data.x = ['07月', '08月', '09月', '10月', '11月', '12月', '01月', '02月', '03月', '04月', '05月', '06月', '07月'];
data.y = [
    ['5', '10', '20', '30', '45', '60', '60', '70', '60', '40', '50', '30', '20'],
    ['15', '20', '35', '40', '45', '60', '50', '70', '60', '45', '50', '10', '30'],
    ['25', '60', '24', '60', '32', '20', '50', '70', '25', '50', '50', '20', '33'],
    ['65', '20', '28', '40', '60', '40', '20', '70', '34', '60', '50', '40', '66'],
    ['55', '30', '30', '10', '18', '60', '30', '70', '37', '55', '50', '25', '88'],
    ['45', '19', '21', '36', '15', '80', '10', '70', '24', '44', '50', '35', '54']
];
data.legend = ['前卫村桥', '黄渡', '浙江路桥', '前卫村桥1', '黄渡1', '浙江路桥1'];
data.color = ['#008BE9', '#00BBE5', '#FF7ECF', '#7ED321', '#FACE15', '#FF2366'];

<!--图表2黑臭水体 - 黑臭比例变化-->
var data2 = {};
data2.x = ['2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01', '2017.01'];
data2.y = ['5', '10', '20', '30', '45', '60', '60', '70', '60', '40', '50', '30', '20'];


<!--图表3近岸海域 - 水质现状评价-水质达标率-->
var data3 = {};
data3.value = [8, 2, 1];
data3.legend = [{name: '达标', icon: 'circle'}, {name: '未达标', icon: 'circle'}, {name: '无数据', icon: 'circle'}];
data3.color = ['#00CE50', '#F55060', '#BDBDBD'];


<!--图表4近岸海域 - 水质现状评价-海水类别构成-->
var data4 = {};
data4.legend = ['优良', '良好', '较好', '较差', '极差'];
data4.color = ['#00BBE5', '#00C95D', '#FFC72E', '#FF7ECF', '#3D5967'];
data4.value = [2, 2, 0, 2, 2];


<!--图表5近岸海域 - 水质现状评价-富营养化状况-->
var data5 = {};
data5.legend = [
    {name: '贫营养', icon: 'circle'},
    {name: '轻度富营养', icon: 'circle'},
    {name: '中度富营养', icon: 'circle'},
    {name: '重富营养', icon: 'circle'},
    {name: '严重富营养', icon: 'circle'}
];
data5.value = [2, 2, 0, 2, 2];
data5.color = ['#008BE9', '#00C95D', '#FFC72E', '#FF7ECF', '#5867C2'];


<!--图表6黑臭水体 - 水质现状评价-断面黑臭状况统计-->
var data6 = {};
data6.legend = [
    {name: '黑臭', icon: 'circle'},
    {name: '正常', icon: 'circle'}
];
data6.value = [67, 398];
data6.color = ['#3D5967', '#00BBE5'];


<!--图表7黑臭水体 - 水质现状评价-评价指标的断面超标率-->
var data7 = {};
data7.color = ['#FF7ECF'];
data7.y = [40, 30, 20, 10];
data7.x = ['氨氮', '透明度', '溶解氧', '氧化还原点位'];

